# x = 5
# अगर x > 0:
#     छापो (" धनात्मक संख्या ")

परिभाषित जोड़ो(संख्या1, संख्या2):                 # def जोड़ो(number1, number2):
    परिणाम = संख्या1 + संख्या2                       #     result = number1 + number2
    वापसी परिणाम                                    #     return result

मुख्य_कार्य():                                     # main():
    संख्या1 = १०                                   #     number1 = 10
    संख्या2 = २०                                   #     number2 = 20
    योग = जोड़ो(संख्या1, संख्या2)                #     sum = जोड़ो(number1, number2)
    छापो("योग है:", योग)                         #     print("Sum is:", sum)

अगर __नाम__ == "__मुख्य__":                       # if __name__ == "__main__":
    मुख्य_कार्य() 